products = [
	"""
	Название продукта - СберЗдоровье
	СберЗдоровье поможет вам оперативно решать семейные медицинские вопросы без лишних затрат времени и средств.

Во-первых, вы сможете получать консультацию детского врача круглосуточно и без очереди, что важно для родителей двоих активных ребятишек. Это позволит избежать долгих ожиданий в больницах и своевременно получить ответы на волнующие вас вопросы о здоровье ваших детей.

Во-вторых, благодаря скидке до 50% на приём у специалистов в более чем 7 тысячах клиник страны, вы сэкономите семейный бюджет, который уже активно расходуется на обучение, развитие и досуг детей. Теперь посещение хорошего специалиста станет доступнее и удобнее.

В-третьих, возможность записываться на прием и сдавать анализы онлайн значительно упростит вашу жизнь, учитывая ваш плотный рабочий график руководителя проекта и необходимость совмещать работу с воспитанием детей. Вы получите больше свободного времени и снизите уровень стресса, связанный с организацией медицинских услуг.
	""",

	"""
		Название продукта - ПДС
	Продукт "ПДС" – надёжный способ обеспечить финансовую стабильность вашей семье.

Во-первых, ваш капитал защищён государством и агентством страхования вкладов, гарантируя сохранность личных сбережений и инвестиционного дохода до 2,8 миллионов рублей. Это важно именно вам, ведь ваша семья и дети зависят от вашего финансового благополучия.

Во-вторых, возможность получать налоговые вычеты позволяет экономить значительную сумму каждый год. Учитывая вашу занятость руководителем проекта и регулярную оплату образовательных услуг детям, эта льгота станет приятным дополнением к семейному бюджету.

И наконец, гибкость управления средствами даёт уверенность в завтрашнем дне. В случае сложной жизненной ситуации, связанной с лечением или потерей кормильца, предусмотрена возможность экстренной выплаты без налогообложения. Всё управление доступно прямо в вашем любимом приложении Сбербанк Онлайн, где вы привыкли совершать платежи и переводы.

	""",

	"""
	Название продукта - ЗЛС
	Защитите своё будущее и спокойствие своей семьи с помощью комплексного страхового решения "Защита на любой случай".

Вот три ключевых преимущества специально для Вас:

1. **Финансовая безопасность**: Ваш активный образ жизни связан с частыми покупками и использованием банковских сервисов. Программа "Сбереги финансы" обеспечит надежную защиту средств на карте и счетах от мошеннических операций и несанкционированных списаний. Это позволит Вам спокойно пользоваться всеми возможностями цифровых технологий и быть уверенным в сохранности своих сбережений.

2. **Защита семейного бюджета**: Ваши регулярные траты на обучение и развитие детей значительны. Модуль "Защита от травм" гарантирует финансовую поддержку в случае непредвиденных ситуаций, таких как травмы ребенка на занятиях спортом или других мероприятиях. Благодаря этому вы сможете избежать дополнительных финансовых затрат и сосредоточиться на восстановлении здоровья вашего ребёнка.

3. **Забота о здоровье**: Ваше стремление поддерживать высокий уровень активности требует внимания к здоровью. Программы "Защиты здоровья", включая "Твой врач", обеспечат своевременную консультацию специалиста и диагностику возможных проблем. Это даст возможность оперативно реагировать на любые изменения состояния здоровья и предотвратить возможные осложнения, сохраняя ваше благополучие и работоспособность.

	""",

	"""
	Название продукта - СберПрайм
СберПрайм – это ваша персональная экономия времени и денег.

Во-первых, вы сможете экономить на детских расходах. Благодаря специальным предложениям от партнеров Сбербанка, вы получите скидки на обучение ребенка в секциях и кружках, а также увеличенный кэшбек за покупки одежды и обуви.

Во-вторых, подписка поможет вам сократить затраты на цифровые услуги. Вы получаете доступ к Okko и Звуку бесплатно, плюс возможность оплачивать мобильную связь и домашний интернет бонусами.

И наконец, СберПрайм позволит вам сэкономить на медицинских услугах. При использовании сервиса СберЗдоровье вы получите скидку до 25% на онлайн-консультации врачей и до 20% на медицинские анализы.
	
	""",

	"""
	Название продукта - Кредитная карта
	Кредитная карта Сбербанка поможет вам эффективно управлять семейным бюджетом и экономить время.

Во-первых, вы сможете планировать крупные семейные траты заранее благодаря возможности разбивать их на несколько месяцев без процентов. Например, покупка спортивной формы детям или обновление техники дома станет проще и комфортнее.

Во-вторых, возможность выбирать пять категорий повышенного кешбэка позволит вернуть часть денег именно там, где ваша семья чаще всего совершает покупки – это могут быть продукты питания, детские товары или услуги такси.

И наконец, удобный доступ к средствам в случае неожиданных расходов обеспечит спокойствие и уверенность в завтрашнем дне. Вы всегда будете готовы оплатить срочную консультацию врача ребенку или купить необходимые вещи без необходимости ждать зарплаты.

	""",

	"""
	Название продукта - Перевод ЗП
	Перевод зарплаты в Сбербанк позволит вам экономить время и деньги благодаря бесплатному обслуживанию карты и выгодным условиям кредитования.

Вот три ключевых преимущества специально для вас:

1. Бесплатное обслуживание вашей карты Сбербанка поможет сократить ваши регулярные расходы, высвободив дополнительные средства для семьи и личных нужд.

2. Вы сможете бесплатно переводить деньги своим близким, например, оплачивать занятия ваших детей в секциях и кружках, избегая лишних комиссий.

3. Благодаря повышенной ставке по депозитам вы получите дополнительный доход от накоплений, который можно направить на обучение детей или другие важные цели.
	""",

	"""
	Название продукта - Детская СберКарта
	Детская СберКарта – удобный инструмент для воспитания финансовой грамотности ваших детей.

Вот три ключевых преимущества специально для вас:

Во-первых, вы сможете легко отслеживать и ограничивать расходы своих детей на кружки, секции и школьные принадлежности благодаря удобному контролю через приложение СберБанк Онлайн. Вы сами устанавливаете лимиты и видите каждую операцию, обеспечивая безопасность и прозрачность.

Во-вторых, ваша семья сможет экономить на повседневных расходах благодаря кэшбэку до 10%. Например, покупая одежду и обувь для детей на маркетплейсах, вы получите приятный возврат средств, которые можно направить на оплату дополнительных занятий или отложить на будущее.

И наконец, детская карта станет отличным подарком вашему ребёнку на день рождения или другой праздник. Гости смогут перечислить средства напрямую на карту, избавляя вас от необходимости собирать наличные и позволяя ребёнку почувствовать себя более взрослым и ответственным.

	""",

	"""
	Название продукта - СберВклад
	СберВклад – это удобный инструмент для сохранения средств и их преумножения специально разработанный для вас.

Во-первых, вы сможете увеличить свой семейный бюджет благодаря повышенной процентной ставке. Например, если у вас есть подписка СберПрайм, получаете зарплату на карту Сбера или держите накопления на специальных счетах, то ваша ставка вырастет дополнительно на 0,7%. Таким образом, ваши сбережения будут работать эффективнее, помогая вам покрывать регулярные семейные расходы, будь то обучение детей или оплата дополнительных занятий.

Во-вторых, удобство управления средствами через Сбербанк Онлайн позволит вам оперативно переводить деньги детям на оплату секций или курсов прямо со своего телефона. Вы можете настроить автоматический платеж, чтобы не забыть о важных расходах, таких как занятия английским или футболом.

И наконец, возможность автоматического продления вклада избавит вас от необходимости посещать офис банка лично. Ваш капитал продолжит приносить прибыль даже после завершения первоначального срока вклада, а значит, вы всегда будете уверены в том, что ваши финансы работают на благо вашей семьи.

		""",

	"""
	Название продукта - СберМобайл
СберМобайл – это мобильный оператор специально разработанный Сбером для удобства клиентов банка.

Во-первых, вы сможете экономить время и деньги благодаря интеграции со СберБанком Онлайн. Все платежи за мобильную связь будут автоматически списываться с вашего счета, а значит никаких лишних действий или комиссий.

Во-вторых, специальные условия для семей. Вы можете подключить своих близких на один тарифный план, управлять расходами всей семьи централизованно и получать скидки на оплату услуг связи сразу нескольких членов вашей семьи.

И наконец, бонусы и кэшбэк от партнеров Сбера. Это позволит вам возвращать часть средств потраченных на продукты питания, детские товары, обучение и другие важные категории ваших ежемесячных трат.
		""",

"""
	Название продукта - Накопительный счет
Накопительный счет поможет вам эффективно распоряжаться семейным бюджетом и получать дополнительный доход ежедневно.

Вот три ключевых преимущества именно для вас:

1. Дополнительный источник дохода без усилий: Ваш семейный бюджет будет работать на вас каждый день благодаря начислению процентов на ежедневный остаток. Это позволит увеличить накопления незаметно и без дополнительных действий.

2. Простота управления финансами семьи: С помощью мобильного приложения СберБанка вы сможете удобно контролировать все операции со счетом, следить за начислениями и планировать семейные траты. Особенно полезно это будет для оплаты детских секций, доставки продуктов и других регулярных расходов.

3. Повышенная доходность в начале пути: Первые три месяца после открытия счета действуют повышенные ставки, что даст возможность быстро начать накапливать дополнительные средства для семейных нужд – будь то оплата обучения детей или покупка новой техники.
""",


	"""
	Название продукта - Перевод пенсии
	Переведя пенсию в Сбербанк, вы получите дополнительные возможности для управления финансами семьи и повышения уровня комфорта.

Во-первых, благодаря повышенному кэшбеку до 20%, вы сможете экономить значительные суммы на регулярных расходах вашей семьи – от доставки продуктов и готовых блюд до оплаты детских секций и занятий спортом. Это позволит вам направлять больше средств на развитие ваших детей и их интересы.

Во-вторых, возможность получать процент на остаток по пенсионной карте Мир – это дополнительный пассивный доход, который поможет покрывать текущие семейные нужды или откладывать средства на будущее, например, на обучение детей или улучшение жилищных условий.

И наконец, отсутствие комиссий за перевод денег внутри Сбербанка и низкие тарифы на межбанковские переводы позволят вам быстро и удобно отправлять деньги близким людям, оплачивать счета и совершать другие финансовые операции без дополнительных затрат времени и средств.
	"""
]