synergy = [
	"""
	
	

	""",

	"""

	Связки с другими продуктами:
Забота о будущем
– При открытии программы долгосрочных сбережений клиенту доступен вклад «Забота о будущем» со ставкой до 20% годовых
Сбербанк Онлайн
– Если клиент пользуется мобильным приложением Сбербанк Онлайн, то удобно следить и пополнять ПДС в приложении
СберНПФ
– Если у клиента оформлен перевод средств в СберНПФ, то с перемещение средств в ПДС позволит уже через 15 лет забрать все средства
– Если клиент предпенсионного возраста (от 50 до 55 женщины, от 55 до 60 лет мужчины), то можно сейчас оформить ПДС и забрать все средства сразу после выхода на пенсию
Накопительный счёт
– держать «буфер» на счёте и настроить автоперевод в ПДС в день зарплаты/по расписанию; повышенная ставка с Прайм помогает быстрее накапливать на взносы.
Вклады
– по окончании вклада сделать единовременный взнос в ПДС; с Прайм вклад зарабатывает больше (+0,7 п.п.), значит больше база для пополнения ПДС.
Дебетовая карта / Сбербанк Онлайн
– настроить автоплатёж в ПДС и лимиты расходов, чтобы взнос уходил «в первую очередь»; с Прайм обслуживание и уведомления по карте могут быть 0 ₽ — экономия идёт на взнос.
Кредитная карта
– крупные траты проводить с кредитки в льготный период (до 120 дней), не трогая накопления/вклады, и не срывая график взносов в ПДС.
СберПрайм/Прайм+
– за счёт повышенных ставок по вкладам/накопительным счетам и кэшбэков легче формировать ежемесячный «пул» на ПДС.
СберМобайл (+ Прайм)
– экономия на связи (для Прайм действует -40% на абонплату) высвобождает бюджет под регулярные взносы; оплату можно автоматизировать, а бонусами Спасибо закрывать часть связи.
СберЗдоровье / ЗЛС (страховые программы)
– мед.скидки и онлайн-сервисы снижают непредвиденные расходы; страхование от мошенников/ТЖС помогает не «вскрывать» ПДС при форс-мажоре.
Зарплатный проект / «Как зарплатный»
– настроить автосписание фиксированного % в день получения зарплаты (или через сервис без смены банка) — дисциплина взносов без ручных действий.
Перевод пенсии
– для пенсионеров/предпенсионеров: автопополнение ПДС в день выплаты пенсии; льготные условия в экосистеме облегчают выделение суммы на взнос.
Детская карта / СберКидс → ПДС в пользу ребёнка
– оформить ПДС на ребёнка как на выгодоприобретателя и параллельно копить на ближайшие цели через «Копилку» в СберКидс — удобный сценарий «длинные + короткие» накопления.

	""",

	"""
Связки с другими продуктами:
* Если у клиента есть подписка СберПрайм и СберПрайм+, то ему доступна дополнительная скидка 10% на полис.
* Если у клиента есть ипотека в Сбере, то полис "Защита дома" станет отличным дополнением, защищая не только стены, но и всё содержимое квартиры.
* Если у клиента есть кредитная или дебетовая карта Сбера, а также вклады, то программа "Сбереги финансы" защитит все его денежные средства в банке от действий мошенников.
* Если клиент активно пользуется картами Сбера (траты от 30 000 ₽), часто переводит деньги или имеет накопительный счет, то его финансы нуждаются в защите, которую предоставляет программа "Сбереги финансы".
* Если у клиента есть дети или детская карта, которые занимаются спортом или отдыхают в лагерях, можно оформить для них программу "Защита от травм".
* Если клиент проводит время на даче или за городом, программа "Защита от клеща" обеспечивает ему быстрое и качественное медицинское обслуживание.
* Если клиент заботится о своем здоровье, часто оплачивает медицинские услуги и хочет иметь доступ к лучшим клиникам, ему подойдет программа "Защита от серьезных болезней".
* Если клиент оформляет полис ЗЛС, он может настроить его автоматическую оплату с дебетовой или кредитной карты Сбера, чтобы никогда не забывать о продлении защиты.

	""",


"""

Связки с другими продуктами:
- Если клиент оплачивает подписку Okko, то с подпиской СберПрайм сервис будет бесплатным
- Если клиент оплачивает подписку Okko, то с подпиской СберПрайм можно подключить до 5 устройств к одному аккаунту
- Если у клиента есть транзакции в категориях повышенного кешбэка, то с подпиской СберПрайм выгода станет больше
- Если у клиента есть дети, то можно оформить подписку Прайм и пользоваться всей семьей
- Если у клиента есть переводы одному и тому же клиенту часто и постоянно, то можно оформить подписку Прайм и пользоваться всей семьей
- Если у клиента есть ипотека, то с подпиской СберПрайм −10% по оформлению защиты объекта недвижимости и здоровья заемщика
- Если у клиента есть транзакции в сервисах покупки билетов на мероприятия, то с подпиской СберПрайм 15% кешбэк на Афише
- Если у клиента есть транзакции в сервисах бронирования жилья, то с подпиской СберПрайм до 17% кешбэк на Отелло
- Если у клиента есть переводы с карт Сбера более чем на 100 000 ₽ за последние 6 месяцев, то с подпиской СберПрайм можно увеличить лимит бесплатных переводов до 500 000 ₽
- Если у клиента есть транзакции по обмену валюты в приложении, то с подпиской СберПрайм курс будет выгоднее
- Если у клиента есть транзакции у партнёров Сбера, то с подпиской СберПрайм доступны спецусловия (бесплатная доставка, повышенный кешбэк)
- Если у клиента есть Сбервклад, то будет +0,7% с подпиской СберПрайм
- Если у клиента есть накопительный счёт, то ставка +1% с подпиской
- Если у клиента есть остаток на карте более 50 000 ₽, то при первом открытии накопительного счёта ставка будет 16% первые 3 месяца
- Если у клиента есть остаток на карте более 50 000 ₽, то +1% к ставке по накопительному счёту
- Если у клиента есть кредитная карта, то с подпиской СберПрайм повышенный кешбэк в 5 категориях
- Если у клиента несколько дебетовых карт, то обслуживание всех карт будет бесплатным при оформлении подписки СберПрайм
- Если у клиента есть СберКарта и списывается ежемесячная оплата (хотя бы 1 раз за последние 3 месяца), то с подпиской СберПрайм обслуживание карты и уведомления станут бесплатными

	""",



"""
Связки с другими продуктами:
–  Если клиент пользуется мобильным приложением Сбербанк онлайн, то удобно смотреть дату и точную сумму платежа по кредитке, чтобы не платить %
–  Если клиент оплачивает через Сбербанк Онлайн жилищно-коммунальные платежи, то можно настроить автоплатеж с кредитной карты, чтобы не пропустить дату
–  Если у клиента есть накопительный счет или вклад, то можно тратить деньги с кредитной карты и не терять проценты по вкладу
–  Если у клиента есть траты по категориям кэшбэка карты (изменяемый параметр), то можно настроить именно эту категорию, чтобы получать повышенные бонусы
–  Если у клиента есть транзакции в Самокате, то можно привязать кредитную карту в приложении и оплачивать с нее покупки 
–  Если у клиента есть транзакции в МегаМаркете, то можно привязать кредитную карту в приложении и оплачивать с нее покупки 
–  Если у клиента есть транзакции в еАптеке, то можно привязать кредитную карту в приложении и оплачивать с нее покупки 
–  Если у клиента есть транзакции у партнеров Сбера (изменяемый параметр), то можно привязать кредитную карту в приложении и оплачивать с нее покупки 
–  Если у клиента есть транзакции на РЖД, Аэрофлот и др перевозчиках, то можно покупать билеты с кредитки, а если билеты надо поменять или сдать, 
то деньги просто вернуться на нее обратно. ПРи этом деньги хранить на вкладах или просто не тратить средства с повседневных расходов в случе отмены или переноса поездки
	""",


"""
Связки с другими продуктами:
–  Оформление потребительского кредита за 5 минут без справок о доходах и посещения офиса
–  Деньги до зарплаты на месяц по сниженной ставке.
–  Скидка 15% от  СберПраво. На сервис по возврату налогов и годовую подписку на услуги юристов
–  СберПрайм на 60 дней за 1 рубль: кешбэк и скидки в сервисах Сбера и партнёров. А ещё кино, музыка и многое другое — для вас и 3 близких. 
–  Скидка 20% от СберМобайла: постоянная скидка на тарифы и в 2 раза больше Гб каждый месяц за перенос номера
–  Скидка 25% на анализы в СберЗдоровье
	""",


"""
Синергия с продуктами банка  
Создана логическая цепочка, где преимущества детской карты усиливаются за счёт интеграции с другими сервисами Сбера:  
1. Детская карта + СберKids + Копилка:  
   — Кешбэк до 10% автоматически зачисляется в детскую копилку в приложении СберKids. Это позволяет ребенку накапливать бонусы на цели (например, игрушки или книги), а родители контролируют процесс через раздел «Близкие» в СберБанк Онлайн.  
   — Копилка с доходностью 11% дополняет кешбэк: накопленные бонусы приносят дополнительный доход, что мотивирует ребёнка учиться финансовой грамотности через СберKids.  
2. Родительский контроль + СберБанк Онлайн:  
   — Бесплатные уведомления интегрированы с разделом «Близкие», где родитель видит все операции по детской карте. Это позволяет оперативно корректировать лимиты и блокировать подозрительные траты, усиливая защиту от мошенничества.  
3. Сбермобайл + QR-оплата:  
   — Тариф Сбермобайл за 299 ₽ обеспечивает стабильный интернет для использования оплаты по QR-коду через СберKids. 
Это критично важно, так как карта может отсутствовать (например, забыта дома), а смартфон с приложением остается доступным.  
4. Платежный стикер + Удобство:  
   — Стикер за 700 ₽ работает как альтернатива пластиковой карте и интегрируется с бесконтактной оплатой через телефон.
Это дополняет функцию QR-кода: если интернет недоступен, стикер позволяет оплатить покупку в терминале, сохраняя удобство даже без смартфона. 
	""",


"""
Связки с другими продуктами:
–  Если у клиента никогда не бвло вкладов в Сбере, то на новые деньги в банке максимальная ставка до 18 %
–  Если у клиента есть вклады, то на новые вклады (не переоформленные) ставка выше
–  Если у клиента есть подписка Сберпрайм, то ставка по Сбервкладу +0,7%
–  Если у клиента есть подписка Сберпрайм, то ставка по накопительному счету +1%
–  Если клиент получает зп в Сбере, то  надбавка +0,7% к ставке по вкладу
–  Если клиент получает пенсию в Сбере, то  надбавка +0,7% к ставке по вкладу
–  Если клиент тратит по картам Сбера свыше 30 000 рублей, то надбавка +0,7% к ставке по вкладу
–  Если у клиента есть накопительный счёт (от 100 000 рублей), то надбавка +0,7% к ставке по вкладу
–  Если клиент пользуется мобильным приложением Сбера, то удобно следить и управлять вкладами в приложении в отдельной вкладке
–  Если у клиента есть дети, то можно оформить специальный вклад для ребенка и позаботиться о его будущем
–  Если возраст клиента от 14 до 17 лет, то можно открыть специальный вклад Молодёжный до 17,6% 
–  Если клиент активно пользуется кредитной картой, то можно разместить средства на накопительный счет , накапливать проценты, а тратить деньги по прежнему с КК
""",






"""
Связки с другими продуктами:
–        Если у клиента есть подписка Прайм , то -40% на абонентскую плату Сбермобайл
–        Если у клиента есть подписка Прайм\Прайм+, то не ограничен интернет в сервисах Okko, Звук, а также мессенджеры и соцсети
–        Если у клиента есть подписка Прайм\Прайм+, то не ограничены звонки по России
–        Если клиент оплачивает мобильную связь, то можно перейти без потери номера на Сбермобайл
–        Если клиент оплачивает мобильную связь другого оператора, то при переходе на Сбермобайл он получит дополнительный ежемесячный пакет интернета бесплатно
–        Если у клиента есть дети, то можно оформить сим карту только для звонков или только для интернета (для планшета) по сниженной стоимости
–        Если у клиента есть дебетовая карта, то можно настроить ежемесячную оплату по тарифу, чтобы всегда оставаться на связи
–        Если у клиента есть кредитная карта, то можно настроить ежемесячную оплату по тарифу с неё, чтобы быть уверенным, что средств достаточно и всегда оставаться на связи
–        Если у клиента есть карты Сбера, то при оплате Сбермобайла начислятся бонусы Спасибо, которые можно также потратить на оплату тарифа в следующие периоды
–        Если клиент пользуется сервисом ОККО, то можно безлимитно смотреть фильмы со Сбермобайлом и подпиской Прайм
–        Если клиент пользуется сервисом Звук, то можно безлимитно слушать музыку со Сбермобайлом и подпиской Прайм
""",


"""
Связки с другими продуктами:
–  Если клиент тратит по картам Сбера от 50 000 рублей в месяц, то +4% к ставке по счёту
–   Если клиент покупает в Самокате на сумму от 5000 рублей в месяц, то +1% к ставке по счёту
–  Если клиент покупает в Купере на сумму от 5000 рублей в месяц, то +1% к ставке по счёту
–  Если клиент покупает в МегаМаркете на сумму от 5000 рублей в месяц, то +1% к ставке по счёту
–  Если клиент покупает в еАптеке на сумму от 5000 рублей в месяц, то +1% к ставке по счёту
–  Если клиент покупает у партнеров Сбера на сумму от 5000 рублей в месяц, то +1% к ставке по счёту
–  Если у клиента есть подписка Прайм, то +1% к ставке по счёту
–  Если у клиента есть подписка Прайм+, то +1% к ставке по счёту
–  Если клиент впервые открывает накопительный счет, то +6% к ставке по счёту
–  Если у клиента есть кредитная карта, то можно тратить средства с неё, а на счёте зарабатывать проценты
–  Клиент может открыть несколько накопительных счетов для того, чтобы откладывать деньги на разные цели
–  Если у клиента заканчивается вклад, то можно по окончании разместить средства на накопительном счёте пока он выбирает новый вклад или условия
–  Если у клиента на картах есть сумма, которая всегда остается по окончании месяца, то ее можно разместить на вклад и получать доход
–  Если клиент получает зп или пенсию на карту Сбера, то можно перевести средства на счет и  сразу же начать получать дополнительный доход
–  Если клиент получает пенсию и запрлату одновременно в Сбер, то можно одну выплату всегда копить на счете и получать дополнительный доход
""",





"""
Связки с другими продуктами:
- СберВклад «Лучший %»: до 18% годовых по спецпредложениям для новых денег
- Кредитная карта для пенсионеров: льготный период до 120 дней без %; ставка от 9,8% на покупки в категории «Здоровье»
- Накопительный счёт: повышенная ставка до 16% на первые 3 месяца при первом открытии; проценты на ежедневный остаток; сумма открытия от 1 ₽
- «Деньги до пенсии»: короткий займ на период до начисления пенсии (до 30 000 ₽)
- Ставка по кредиту ниже на 2% для получателей пенсии в Сбере
- Если клиент регулярно снимает пенсию со счёта/вклада, оформить дебетовую карту — круглосуточный доступ к наличным в банкоматах Сбера
- СберБанк Онлайн: настроить автоплатежи (ЖКХ, связь и др.), напоминания и контроль поступлений
- СберСпасибо: за покупки начисляются бонусы; ими можно оплачивать товары/услуги у партнёров (до 99% стоимости)
- СберМобайл: связь можно оплачивать бонусами «Спасибо» до 99% (бонусы копятся по СберКарте)
"""


]